benchmarks/https_ab_after_sslwait_20260325_161702/local_https_r1_ping_c1024.wrk.out
Running 5s test @ https://127.0.0.1:18080/ping
  16 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.95ms   31.79ms 491.75ms   97.06%
    Req/Sec     3.98k   817.55     8.31k    89.73%
  Latency Distribution
     50%   14.41ms
     75%   18.48ms
     90%   24.89ms
     99%  195.60ms
  297747 requests in 5.10s, 32.65MB read
Requests/sec:  58364.69
Transfer/sec:      6.40MB