benchmarks/https_ab_after_sslwait_20260325_161702/upstream_ref_https_r2_ping_c1024.wrk.out
Running 5s test @ https://127.0.0.1:18080/ping
  16 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.01ms   20.16ms 352.18ms   96.69%
    Req/Sec     3.22k   713.74    13.79k    94.72%
  Latency Distribution
     50%   19.71ms
     75%   24.47ms
     90%   29.19ms
     99%  126.34ms
  245005 requests in 5.08s, 26.87MB read
Requests/sec:  48207.53
Transfer/sec:      5.29MB